#+TITLE: Arrays
#+AUTHOR: DiegoAGtz
#+DATE: <2022-02-11 vie.>

** Longitud del array
La longitud de un arreglo la podemos obtener de la siguiente

#+begin_src js
let frutas = ['manzana', 'banana'];
console.log(frutas.length);
#+end_src

#+RESULTS:
: 2
: undefined

** Recorrer un array
Podemos hacerlo de distintas maneras y con cada uno de los bucles existentes.
El método forEach() ejecuta la función indicada una vez por cada elemento del array.

#+begin_src js
let frutas = ['manzana', 'banana'];
frutas.forEach((elemento, indice) => console.log(elemento, indice));
#+end_src

#+RESULTS:
: manzana 0
: banana 1
: undefined

** Eliminar el último elemento del array

#+begin_src js
let frutas = ['manzana', 'banana'];
let ultimo = frutas.pop();
console.log(ultimo);
console.log(frutas);
#+end_src

#+RESULTS:
: banana
: [ 'manzana' ]
: undefined

** Eliminar el primer elemento del array

#+begin_src js
let frutas = ['manzana', 'banana'];
let primero = frutas.shift();
console.log(primero);
console.log(frutas);
#+end_src

#+RESULTS:
: manzana
: [ 'banana' ]
: undefined

** Encontrar el ínndice de un elemento del array

#+begin_src js
let frutas = ['manzana', 'banana'];
let pos = frutas.indexOf('banana');
console.log(pos);
#+end_src

#+RESULTS:
: 1
: undefined

** Acceso a los elementos del array
Las posicines de los arreglos comienzan en 0, para obtener el último elemento podemos utiliar la propiedad length del arreglo.

#+begin_src js
let arr = ['primer elemento', 'segundo elemento', 'tercer elemento', 'último elemento'];
console.log(arr[0]);
console.log(arr[2]);
console.log(arr[arr.length - 1]);
#+end_src

#+RESULTS:
: primer elemento
: tercer elemento
: último elemento
: undefined

